#+title: My Doom Emacs Configuration
#+startup: overview


** org id
#+begin_src emacs-lisp
(require 'org-id)
(setq org-id-link-to-org-use-id t)

(defun mcj/org-id-create ()
  "Create and store a human readable ID for the current heading."
  (let* ((title (or (nth 4 (org-heading-components)) ""))
         (san (replace-regexp-in-string "[^[[:alpha:]]]+" "_" (downcase title)))
         (san (replace-regexp-in-string "^_+\\|_+$" "" san))
         (new-id (format "L%s_%s" (format-time-string "%Y%m%d.%H%M%S") (if (string= san "") "untitled" san))))
    (org-entry-put nil "ID" new-id)
    ;; register to org-id locations
    (org-id-add-location new-id (or (buffer-file-name (buffer-base-buffer)) (buffer-file-name)))))

(defun mcj/org-id-get-or-create ()
  "Return the ID of the current entry, creating one if absent."
  (let ((old (org-entry-get nil "ID")))
    (if (and old (stringp old) (> (length old) 0))
        old
      (mcj/org-id-create)
      (org-entry-get nil "ID"))))
(defun mcj/org-id-create-if-needed ()
  "If the current node does not have a ID, create one."
  (interactive)
  (org-with-point-at nil
    (let ((old-id (org-entry-get nil "ID")))
      (if (and old-id (stringp old-id))
          (when (called-interactively-p 'any)
            (message "ID already exists. Not overwriting it."))
        (mcj/org-id-create)))))

;; Add mcj/org-id-create-if-needed as advice. For this we need a wrapper function that passes its argument to org-store-link
(defun mcj/org-id-advice (&rest _args)
  (when (org-before-first-heading-p)
    ;; nothing to do if not in heading - optional guard
    )
  (mcj/org-id-get-or-create)
  (org-id-update-id-locations))

(advice-add 'org-store-link :before #'mcj/org-id-advice)

(defun novel-auto-generate-id-after-snippet ()
  (when (looking-back "temp-id-placeholder" (line-beginning-position))
    (delete-region (line-beginning-position) (line-end-position))
    (mcj/org-id-get-or-create)))
(add-hook 'yas-after-exit-snippet-hook #'novel-auto-generate-id-after-snippet)

#+end_src

#+RESULTS:
| novel-auto-generate-id-after-snippet |

